var timelineZH = {
    'Now': {
        'short': '',
        'long': '',
    },
    '2017': {
        'short': '<p><strong>總結</strong>：Epimaps, 粵拼表，粵語坊的粵語學習產品，粵拼標註工具</p>\n' +
        '<ul>\n' +
        '<li>完成了一個基於 MEAN（除了 Mongo 之外）搭建的項目，此項目是一個探索維基導航框的工具，同時這也是一個讓我熟悉 Angular 2+ 的機會</li>\n' +
        '<li>用 AngularJS 寫了粵拼表，並且自己錄了超過一千五百個語音檔，記載了粵語裡面絕大部分的拼音和聲調的組合</li>\n' +
        '<li>推出了兩個學習粵語的產品，總收益合共 USD 3,524.45</li>\n' +
        '<li>自己編寫了一個讓我在中文字上方標註粵語拼音的工具，方便製造粵語產品的製作過程</li>\n' +
        '</ul>',
        'long': '<p><strong>目的</strong></p>\n' +
        '<ul>\n' +
        '<li>完成一個全棧的項目</li>\n' +
        '<li>學會如何建立一個觀眾群，並且設計產品促進銷售</li>\n' +
        '</ul>\n' +
        '<p><strong>理據</strong><br />這個過程讓我充分地體驗了軟件開發的過程所涉及到不同的角色，包括 scrum master, 前台開發者，後台開發者，項目管理員等角色，確保我有足夠的技術含量去獨立完成一個具有一定難度的技術項目。這個過程也同時給予我一個機會熟悉 Angular 2+ 的框架，因為上上下下很多技術細節跟其前任 AngularJS 確實很不一樣。</p>\n' +
        '<p>同時，我在這段時間里也有開始學習 Python 和 React，但是如果我缺乏一個實踐的機會，我還是覺得自己怎麼學也不會學到一個足夠流利的程度，所以最終還是決定先擱置一邊，先把 Angular 學懂再看。</p>\n' +
        '<p>至於我網站上的產品而言，我其實主要的目的就是完成我休學那一年沒有完成的一個環節 - 就是如何網上推銷電子產品。我自認為以下三個技能對我將來至關重大，因此決定嘗試做做看：一、如何建立群眾關注自己的網站；二、如何創造合適目標群眾的口味的內容；三、從頭到尾推出一個新的產品，包括編寫廣告函以及推廣新產品。當我建立了足夠大的觀眾群的時候，我就決定開始進行銷售。</p>\n' +
        '<p><strong>相關鏈接</strong></p>\n' +
        '<ul>\n' +
        '<li><a href="https://github.com/BaggioWongHK/epimaps-backend" target="_blank">https://github.com/BaggioWongHK/epimaps-backend</a> </li>\n' +
        '<li><a href="https://github.com/BaggioWongHK/epimaps-frontend" target="_blank">https://github.com/BaggioWongHK/epimaps-frontend</a> </li>\n' +
        '<li><a href="https://cantolounge.com/jyutping-chart/" target="_blank">https://cantolounge.com/jyutping-chart/</a> <strong><br /></strong></li>\n' +
        '</ul>',
    },
    '2016': {
        'short': '<p><strong>總結</strong>：進行廣東話、英語、普通話的線上教學，編寫了 Cantolounge 粵語學習平台（初稿）</p>\n' +
        '<ul>\n' +
        '<li>教授 144 個學生，一共上了 736 節課</li>\n' +
        '<li>開創了一個廣東話學習的網站，在不同的關鍵詞上獲得谷歌頭五位的排名，Facebook 專頁獲得 1061 個關注，以及積累了 1332 個電郵訂閱者</li>\n' +
        '<li>用 AngularJS 編寫了一個廣東話學習平台，平台上提供一系列的學習模式</li>\n' +
        '</ul>',
        'long': '<p><strong>目的</strong></p>\n' +
        '<ul>\n' +
        '<li>積累作為一個教師的經驗以及學習如何有效地教導學生</li>\n' +
        '<li>通過創造廣東話的學習平台和網站幫助學習廣東話的學生</li>\n' +
        '</ul>\n' +
        '<p><strong>理據</strong><br />我從小到大都有當教師的夢想，雖然大學時代已經選擇踏上了軟件工程師的道路，然而，我還是想看看我能否圓夢。通過擔任老師這角色，我確信從中提高了我的演講技巧，同時也進一步鞏固了我切換語言的能力，當學生不知道可以說什麼的時鼓勵他們開口講。</p>\n' +
        '<p>但是，我得出來的結論卻讓我感到非常意外 - 我覺得自己並不適合當老師。為什麼呢？我認為最重要的原因是因為我之後發現同時要兼顧不同水平、持有不同目的、不同學習風格的學生並非易事。或許在一個正規化的環境對一群學生進行教學是一個不一樣的體驗，但目前為止這對我來說是一個不可行的職業。</p>\n' +
        '<p>老師當不了，但是教學的心態卻沒有滅掉。我正是因為這份教學的心而創造了廣東話的學習平台，同時也想過這可能成為一個收入來源。但是，經過多番的考慮，從一個營銷的角度，先設計產品後推銷是一個錯誤的策略，因此我還是決定按照傳統的銷售渠道入手，最後決定創建了粵語坊一網站。</p>\n' +
        '<p><strong>相關鏈接</strong><br /><a href="https://www.italki.com/baggio" target="_blank">https://www.italki.com/baggio</a> </p>',
    },
    '2014': {
        'short': '<p><strong>總結</strong>：完成大學大三和大四，在 italki 作為一個前台開發者實習</p>\n' +
        '<ul>\n' +
        '<li>完成了復旦大學四年的學業，得到了軟件工程的工程學位</li>\n' +
        '<li>大四一年在 italki 作為一個前台開發者實習，主要在 AngularJS 框架下實現一些新的功能</li>\n' +
        '<li>同時也用 Protractor 編寫集成測試</li>\n' +
        '<li>一開始的時候為了熟悉公司的代碼，通過閱讀和寫注釋學習 AngularJS</li>\n' +
        '<li>在學校編寫了一個基於 AngularJS 的旅遊景點項目，這個小程序支持搜索、標識、評論以及標籤旅遊景點</li>\n' +
        '</ul>',
        'long': '<p><strong>目標</strong></p>\n' +
        '<ul>\n' +
        '<li>大學畢業</li>\n' +
        '<li>在真實的環境里積累開發工作的經驗</li>\n' +
        '</ul>\n' +
        '<p><strong>理據</strong><br />我把「大學畢業」列入目的之一的原因是因為實不相瞞，我上大學的四年內在某幾個課程內遇到不少的學習困難，具體說，我在高等數學和大學物理的課程內花了不少的精神和努力才能通過。由於我中小學的教育差不多 70% 都是以英語作為教學語言，再次適應聽一種不習慣聽課的語言花了我一段時間。而且，由於我進大學的時候只有可能初中的物理水平，所以跨這麼大的一步對我來說非常吃力。但是，通過我自身的努力，以及周邊朋友和老師們的鼓勵下，我終於通過這些過程。六個數學和物理的課程可以說是我大學四年學業最大的瓶頸位。</p>\n' +
        '<p>此外，作為課程要求的一部分，我在學校附近的科技公司申請了不同的職位。很不幸的是，雖然我屢次通過面試的環節，由於大公司（如 IBM、Lenovo 和 SAP）的人力部門的政策，作為一個持有外國戶籍的學生，我多次被拒之門外。幸好，我最後在 italki 得到一個實習的機會，在一個在敏捷開發的原則下運營的團隊里積累了不少的前端開發經驗，那時候跟其他同事相處相當愉快。</p>\n' +
        '<p>當我離開公司的時候，回想一下，我還是非常感謝 italki 給了我一個這麼豐富的機會實習。儘管我是一個實習生，我沒有因此而被歧視，我能夠被當做一個普通的員工得到不少的機會學習，而自己所編寫的代碼也會更新到網站的最新版本。除此以外，我也有機會編寫集成測試，寫注釋以及閱讀後端的 Python 代碼。我臨走的時候基本上讀懂了代碼的結構和邏輯，但是最終沒有機會動手寫後端代碼，所以有點可惜。</p>\n' +
        '<p><strong>相關鏈接</strong><br /><a href="https://github.com/BaggioWong/tourist-hotspots" target="_blank">https://github.com/BaggioWong/tourist-hotspots</a></p>',
    },
    '2013': {
        'short': '<p><strong>總結</strong>：uDogBeds 和 Ted\'s Tillers 電商網站，自由撰稿工作</p>\n' +
        '<ul>\n' +
        '<li>修了一年學持續進修，開始了幾個網上營銷的項目，包括推出了兩個賣狗床和庭院器材的電商網站</li>\n' +
        '<li>作為一個自由撰稿者工作了半年的時間</li>\n' +
        '<li>在一個香港的本地的社區中心做了一個暑假的義工工作，幫小學生補習</li>\n' +
        '</ul>',
        'long': '<p><strong>目的</strong></p>\n' +
        '<ul>\n' +
        '<li>在網上探索不同的盈利獲取渠道</li>\n' +
        '</ul>\n' +
        '<p><strong>理據</strong><br />我念大二的時候，我學業上感到莫大的壓力和挫折感，壓力來自於高等數學和大學物理的課程，而挫折感來自於我對於目前學校裡面學到的知識和技能感到不足之處，最終決定休一年學。</p>\n' +
        '<p>我休學的一年中，我認為學習網上營銷會對於我的發展有利，因此開始了幾個營銷的項目，主要專注點放在電子商務上。同時，我也有試驗過通過網站進行聯盟營銷，但是這類型的網站很難持續下去。我那年也作為一個撰稿者工作了半年的時間，我主要的責任是負責編寫一些為搜索引擎優化的英文文章，同時也讓我感受到遠端工作是一個什麼樣的體驗。</p>\n' +
        '<p>如果要說一年做過最有收穫的事情那肯定就是電商。我記得開始了沒多久，我每天起來的時候都非常期待迎接新的挑戰，之間也創造了不錯的佳績，比如，在 AdWords 平台上得到相當高的點擊轉化率，在聖誕節期間得到 $1616.73 的盈利額。雖然我那時候想繼續做下去，但是由於自己缺乏資金（在 AdWords 賣廣告不便宜），最後只能夠放棄。</p>\n' +
        '<p>那年我學到的技術包括，打好搜索引擎優化的基礎，如何跟美國供應商協商，如何有效地管理 AdWords 在線推廣活動以及減低每次點擊費用，如何判斷一個產品的可買性，把產品適當地定位，對實體產品進行買賣。</p>\n' +
        '<p><strong>相關鏈接</strong></p>\n' +
        '<p><a href="https://goo.gl/EoBCgw" target="_blank">https://goo.gl/EoBCgw\f</a></p>',
    },
    '2011': {
        'short': '<p><strong>總結</strong>：完成兩年的大學</p>\n' +
        '<ul>\n' +
        '<li>展開了我在復旦的大學生涯</li>\n' +
        '<li>主要用 Java 和 C 編寫代碼</li>\n' +
        '</ul>',
        'long': '<p><strong>目的</strong><br />主要就是適應大學生活，深入地理解中國的文化，以及打好扎實的軟件基礎</p>\n' +
        '<p><strong>理據</strong><br />我在這段時間不能說我做過很多有意義的事情，因為大學的學習跟之前的學習非常地不一樣，我相信我也是跟其他的同學一樣嘗試渡過適應期而已。</p>\n' +
        '<p>這段時間最值得提起的功績應該就是打好了韓文和西班牙文的基礎，之間也斷斷續續地保持了日文和法文的水平。雖然我只學了半年的西班牙文，但是韓文來說，通過接近五年的自習，我覺得我還是能夠應付一般的日常對話的。</p>\n' +
        '<p><strong>相關鏈接</strong></p>\n' +
        '<ul>\n' +
        '<li><a href="https://github.com/BaggioWong/java-algorithm-problems" target="_blank">https://github.com/BaggioWong/java-algorithm-problems</a></li>\n' +
        '<li><a href="https://github.com/BaggioWong/python-algorithm-problems" target="_blank">https://github.com/BaggioWong/python-algorithm-problems</a></li>\n' +
        '</ul>',
    },
    '2010': {
        'short': '<p><strong>總結</strong>：從奧斯翰畢業</p>\n' +
        '<ul>\n' +
        '<li>主要花了一年體驗以及習慣用中文上課是怎麼樣的事情</li>\n' +
        '</ul>',
        'long': '<p><strong>目的</strong><br />為在中國上大學做好準備</p>\n' +
        '<p><strong>理據</strong><br />這部分已經在我地視頻裡面講述過，請點擊我的頭像前往視頻看看。</p>',
    },
    '2005': {
        'short': '<p><strong>總結</strong>：在西島中學念書，課外也有參加不同的課程，我也是通過一個本地的培訓機構第一次接觸 Java</p>\n' +
        '<ul>\n' +
        '<li>我在一所英國的國際學校唸書</li>\n' +
        '<li>開始參加種種的課外課程，如 Java，Adobe 設計軟件等</li>\n' +
        '<li>我自己也有自行在其他知識領域進行探索，如投資、行為心理學、外語，但最終還是決定學軟件</li>\n' +
        '</ul>',
        'long': '<p><strong>目的</strong></p>\n' +
        '<ul>\n' +
        '<li>讓英語達到母語水平</li>\n' +
        '<li>讓法語和日語達到能夠對話的水平</li>\n' +
        '<li>探索不同的興趣判斷將來可行的職業道路</li>\n' +
        '</ul>\n' +
        '<p><strong>理據</strong><br />轉到一所國際學校對我的批判性思維發展起了非常關鍵的作用。我在國際學校就讀的時段充分地讓我成為一個國際化的社群的一份子，以及給予我一個機會體會友誼、憐憫、合作等價值觀。</p>\n' +
        '<p>我在唸書的時期，我主要把我的課外時間都花在探索不同知識領域上，包括股票投資、中國的玄學以及學習各種外語不等。但是我最終還是決定了踏上一條最初沒有想過的道路：軟件。</p>',
    },
    '2004': {
        'short': '<p><strong>總結</strong>：堅尼地小學畢業</p>\n' +
        '<ul>\n' +
        '<li>轉到一家英國的國際小學</li>\n' +
        '</ul>',
        'long': '',
    },
    '2002': {
        'short': '<p><strong>總結</strong>：轉到地利亞加拿大小學</p>\n' +
        '<ul>\n' +
        '<li>那時候因為出現磨牙和焦慮等症狀，所以父母把我轉到加拿大的國際學校，這些症狀也隨之消失</li>\n' +
        '</ul>',
        'long': '',
    },
    '1999': {
        'short': '<p><strong>總結</strong>：在聖保羅書院小學就讀</p>\n' +
        '<ul>\n' +
        '<li>在一所以粵語授課的本地小學就讀</li>\n' +
        '</ul>',
        'long': '',
    },
    '1993': {
        'short': '<p><strong>總結</strong>：在香港出生</p>',
        'long': '',
    }
};